fn book(загальна_кількість_сторінок: i32, цільова_сторінка: i32) -> i32 {
    let перегортання_з_початку = цільова_сторінка / 2;
    let перегортання_з_кінця = (загальна_кількість_сторінок - цільова_сторінка) / 2;
    перегортання_з_початку.min(перегортання_з_кінця)
}
fn main() {
    let загальна_кількість_сторінок = 6;
    let цільова_сторінка = 2;

    let результат = book(загальна_кількість_сторінок, цільова_сторінка);
    println!("Мінімальна кількість перегортань: {}", результат);}
